MBronsom/OfflineSWD/Firmware/keil_standard_20200910/RL/USB/Drivers/usbh_stm32f20x.c
  /* Prepare transfer                                                         */
                                                  /* Prepare HCCHAR register  */
  hcchar &= USBH_STM32_HCCHAR_ODDFRM|             /* Keep ODDFRM              */
            USBH_STM32_HCCHAR_DAD   |             /* Keep DAD                 */
            USBH_STM32_HCCHAR_MCNT  |             /* Keep MCNT                */
            USBH_STM32_HCCHAR_EPTYP |             /* Keep EPTYP               */
            USBH_STM32_HCCHAR_LSDEV |             /* Keep LSDEV               */
            USBH_STM32_HCCHAR_EPNUM |             /* Keep EPNUM               */
            USBH_STM32_HCCHAR_MPSIZ ;             /* Keep MPSIZ               */
  switch (tgl_typ & 0x0F) {
    case USBH_PACKET_IN:
      hcchar   |=  USBH_STM32_HCCHAR_EPDIR;
      hcintmsk  =  USBH_STM32_HCINTMSK_DTERRM | 
                   USBH_STM32_HCINTMSK_BBERRM | 
                   USBH_STM32_HCINTMSK_TXERRM | 
                   USBH_STM32_HCINTMSK_ACKM   | 
                   USBH_STM32_HCINTMSK_NAKM   | 
                   USBH_STM32_HCINTMSK_STALLM | 
                   USBH_STM32_HCINTMSK_XFRCM  ;
      break;
    case USBH_PACKET_OUT:
      hcchar   &= ~USBH_STM32_HCCHAR_EPDIR;
      hcintmsk  =  USBH_STM32_HCINTMSK_TXERRM | 
                   USBH_STM32_HCINTMSK_NYET   | 
                   USBH_STM32_HCINTMSK_NAKM   | 
                   USBH_STM32_HCINTMSK_STALLM | 
                   USBH_STM32_HCINTMSK_XFRCM  ;
      break;
    case USBH_PACKET_SETUP:
      hcchar   &= ~USBH_STM32_HCCHAR_EPDIR;
      hcintmsk  =  USBH_STM32_HCINTMSK_TXERRM | 
                   USBH_STM32_HCINTMSK_NAKM   | 
                   USBH_STM32_HCINTMSK_STALLM | 
                   USBH_STM32_HCINTMSK_XFRCM  ;
      break;
    case USBH_PACKET_PING:
      hcchar   &= ~USBH_STM32_HCCHAR_EPDIR;
      hcintmsk  =  USBH_STM32_HCINTMSK_TXERRM | 
                   USBH_STM32_HCINTMSK_ACKM   | 
                   USBH_STM32_HCINTMSK_NAKM   | 
                   USBH_STM32_HCINTMSK_STALLM | 
                   USBH_STM32_HCINTMSK_XFRCM  ;
      break;
  }
  hcchar &= ~USBH_STM32_HCCHAR_CHDIS;
  hcchar |=  USBH_STM32_HCCHAR_CHENA;

                                                  /* Prepare HCTSIZ register  */
  hctsiz &= USBH_STM32_HCTSIZ_DPID;               /* Keep DPID                */
  if ((tgl_typ & 0x0F) == USBH_PACKET_SETUP) {    /* If setup pckt DPID=MDATA */
    hctsiz &= ~USBH_STM32_HCTSIZ_DPID;
    hctsiz |=  USBH_STM32_HCTSIZ_DPID_MDATA;
  } else if ((tgl_typ >> 5) & 1) {                /* If toggle force bit activ*/
    if ((tgl_typ >> 4) & 1) {                     /* Toggle bit value         */
      hctsiz &= ~USBH_STM32_HCTSIZ_DPID;
      hctsiz |=  USBH_STM32_HCTSIZ_DPID_DATA1;
    } else {
      hctsiz &= ~USBH_STM32_HCTSIZ_DPID;
      hctsiz |=  USBH_STM32_HCTSIZ_DPID_DATA0;
    }
  }
  if ((tgl_typ & 0x0F) == USBH_PACKET_PING) {     /* If OUT pckt DOPING       */
    hctsiz |= USBH_STM32_HCTSIZ_DOPING;
  }

  mpsiz = hcchar & 0x7FF;                         /* Maximum packet size      */
  if (len) {                                      /* Normal packet            */
    hctsiz |= ((len+mpsiz-1) / mpsiz) << 19;      /* Prepare PKTCNT field     */
    hctsiz |= ( len                 ) <<  0;      /* Prepare XFRSIZ field     */
  } else {                                        /* Zero length packet       */
    hctsiz |= ( 1                   ) << 19;      /* Prepare PKTCNT field     */
    hctsiz |= ( 0                   ) <<  0;      /* Prepare XFRSIZ field     */
  }

  ch_idx  = USBH_STM32_CH_GetIndexFromCH (ctrl, ptrCH);

  ptrCH->HCINTMSK = hcintmsk;                     /* Enable channel interrupts*/
  ptrCH->HCTSIZ   = hctsiz;                       /* Write ch transfer size   */

  /* load_data == __TRUE if there is data to be loaded to FIFO 
    (If packet is OUT or SETUP and len > 0)                                   */
  load_data = (((tgl_typ & 0x0F) == USBH_PACKET_OUT)    || 
               ((tgl_typ & 0x0F) == USBH_PACKET_SETUP)) && 
                 len; 

  if (load_data)
    USBH_STM32_DMA_Wait(ctrl);

  ptrCH->HCCHAR = hcchar;                         /* Write ch characteristics */

  if (load_data)
    USBH_STM32_DMA_Start (ctrl, OTG_DFIFO[ctrl][ch_idx], (U32 *)(buf), len);

  return (__TRUE);
}


/************************** Module Functions **********************************/

/*------------------------- USBH_STM32_Get_Capabilities ------------------------
 *
 *  Get capabilities of Host Controller Driver
 *
 *  Parameter:  cap:        Pointer to USBH_HCI_CAP structure where 
 *                          capabilities are loaded
 *  Return:
 *----------------------------------------------------------------------------*/

void USBH_STM32_Get_Capabilities (USBH_HCI_CAP *cap) {
  cap->MultiPckt = __TRUE;
  cap->MaxDataSz = 512;
  cap->CtrlNAKs  = 100000;
  cap->BulkNAKs  = 1000000;
}


/*------------------------- USBH_STM32_Delay_ms --------------------------------
 *
 *  Delay execution (in milliseconds)
 *  Calibration is done if global variable calDelay is 0
 *
 *  Parameter:  ms:         Number of milliseconds to delay execution for
 *  Return:
 *----------------------------------------------------------------------------*/

void USBH_STM32_Delay_ms (U32 ms) {
  U32 cnt = 0, vals = 0, vale = 0;

start:
  if (!calDelay) {                      /* If not calibrated                  */
    cnt = 1000;
    if (!(SysTick->CTRL & SysTick_CTRL_ENABLE_Msk)) {
                                        /* If SysTick timer not running       */
      vals = 0xFFFFFF;
      SysTick->LOAD  = 0xFFFFFF;
      SysTick->VAL   = 0xFFFFFF;
      SysTick->CTRL  = SysTick_CTRL_CLKSOURCE_Msk | 
                       SysTick_CTRL_ENABLE_Msk;
    } else {
      vals = SysTick->VAL;              /* Timer start value                  */
    }
  } else {
    cnt = ms * calDelay;
  }

  while (cnt--);

  if (!calDelay) {                      /* If not calibrated                  */
    vale = SysTick->VAL;                /* Timer end value                    */
    if (vale >= vals)                   /* If timer reloaded                  */
      vals += SysTick->LOAD;
    calDelay = SystemCoreClock / (vals - vale);   /* Calibrated value         */
    if (vals == 0xFFFFFF)               /* Stop timer if we started it        */
      SysTick->CTRL  = 0;
    goto start;
  }
}


/*------------------------- USBH_STM32_Pins_Config -----------------------------
 *
 *  Configurate or unconfigurate pins used by the USB Host
 *
 *  Parameter:  ctrl:       Controller index (0 = OTG_FS, 1 = OTG_HS)
 *              on:         __TRUE = configurate, __FALSE = unconfigurate
 *  Return:                 __TRUE = Ok, __FALSE = error
 *----------------------------------------------------------------------------*/

BOOL USBH_STM32_Pins_Config (U8 ctrl, BOOL on) {
  if (!ctrl) {
    if (on) {
      usbh_stm32_cfg_pin (PORT_A, 10, (2)|(0<<3)|(10 << 7));/* PA10: OTG_FS_ID*/
      usbh_stm32_cfg_pin (PORT_A, 11, (2)|(3<<3)|(10 << 7));/* PA11: OTG_FS_DM*/
      usbh_stm32_cfg_pin (PORT_A, 12, (2)|(3<<3)|(10 << 7));/* PA12: OTG_FS_DP*/
#ifdef __XYNERGY
      usbh_stm32_cfg_pin (PORT_B,  2, (1)|(1<<11));         /* PB2:  OTG_SW_ON*/
#else
      usbh_stm32_cfg_pin (PORT_H,  5, (1)|(1<<11));         /* PH5:  OTG_FS_PS*/
#endif
      USBH_STM32_Port_Power (0, __FALSE);         /* Turn off port power      */
    } else {
#ifdef __XYNERGY
      usbh_stm32_uncfg_pin (PORT_B,  2);          /* PB2:  reset mode         */
#else
      usbh_stm32_uncfg_pin (PORT_H,  5);          /* PH5:  reset mode         */
#endif
      usbh_stm32_uncfg_pin (PORT_A, 10);          /* PA10: reset mode         */
      usbh_stm32_uncfg_pin (PORT_A, 11);          /* PA11: reset mode         */
      usbh_stm32_uncfg_pin (PORT_A, 12);          /* PA12: reset mode         */
    }
  } else if (ctrl == 1) {
    if (on) {
#ifdef __OTG_HS_EMBEDDED_PHY
      usbh_stm32_cfg_pin (PORT_B, 14, (2)|(3<<3)|(12 << 7));/* PB14: OTG_HS_DM*/
      usbh_stm32_cfg_pin (PORT_B, 15, (2)|(3<<3)|(12 << 7));/* PB15: OTG_HS_DP*/
#else
      usbh_stm32_cfg_pin (PORT_H,  4, (2)|(3<<3)|(10 << 7));/* PH4:  ULPI_NXT */
      usbh_stm32_cfg_pin (PORT_I, 11, (2)|(3<<3)|(10 << 7));/* PI11: ULPI_DIR */
      usbh_stm32_cfg_pin (PORT_C,  0, (2)|(3<<3)|(10 << 7));/* PC0:  ULPI_STP */
      usbh_stm32_cfg_pin (PORT_A,  5, (2)|(3<<3)|(10 << 7));/* PA5:  ULPI_CLK */
      usbh_stm32_cfg_pin (PORT_B,  5, (2)|(3<<3)|(10 << 7));/* PB5:  ULPI_D7  */
      usbh_stm32_cfg_pin (PORT_B, 13, (2)|(3<<3)|(10 << 7));/* PB13: ULPI_D6  */
      usbh_stm32_cfg_pin (PORT_B, 12, (2)|(3<<3)|(10 << 7));/* PB12: ULPI_D5  */
      usbh_stm32_cfg_pin (PORT_B, 11, (2)|(3<<3)|(10 << 7));/* PB11: ULPI_D4  */
      usbh_stm32_cfg_pin (PORT_B, 10, (2)|(3<<3)|(10 << 7));/* PB10: ULPI_D3  */
      usbh_stm32_cfg_pin (PORT_B,  1, (2)|(3<<3)|(10 << 7));/* PB1:  ULPI_D2  */
      usbh_stm32_cfg_pin (PORT_B,  0, (2)|(3<<3)|(10 << 7));/* PB0:  ULPI_D1  */
      usbh_stm32_cfg_pin (PORT_A,  3, (2)|(3<<3)|(10 << 7));/* PA5:  ULPI_D0  */
#ifdef __MCBSTM32F200
      usbh_stm32_cfg_pin (PORT_C,  2, (1)|(1<<2)|(1 << 11));/* PC2:  OD output*/
#endif
#endif
      USBH_STM32_Port_Power (1, __FALSE);         /* Turn off port power      */
    } else {
#ifdef __OTG_HS_EMBEDDED_PHY
      usbh_stm32_uncfg_pin (PORT_B, 14);          /* PB14: reset mode         */
      usbh_stm32_uncfg_pin (PORT_B, 15);          /* PB15: reset mode         */
#else
      usbh_stm32_uncfg_pin (PORT_H,  4);          /* PH4:  reset mode         */
      usbh_stm32_uncfg_pin (PORT_I, 11);          /* PI11: reset mode         */
      usbh_stm32_uncfg_pin (PORT_C,  0);          /* PC0:  reset mode         */
      usbh_stm32_uncfg_pin (PORT_A,  5);          /* PA5:  reset mode         */
      usbh_stm32_uncfg_pin (PORT_B,  5);          /* PB5:  reset mode         */
      usbh_stm32_uncfg_pin (PORT_B, 13);          /* PB13: reset mode         */
      usbh_stm32_uncfg_pin (PORT_B, 12);          /* PB12: reset mode         */
      usbh_stm32_uncfg_pin (PORT_B, 11);          /* PB11: reset mode         */
      usbh_stm32_uncfg_pin (PORT_B, 10);          /* PB10: reset mode         */
      usbh_stm32_uncfg_pin (PORT_B,  1);          /* PB1:  reset mode         */
      usbh_stm32_uncfg_pin (PORT_B,  0);          /* PB0:  reset mode         */
      usbh_stm32_uncfg_pin (PORT_A,  3);          /* PA5:  reset mode         */
#ifdef __MCBSTM32F200
      usbh_stm32_uncfg_pin (PORT_C,  2);          /* PC2:  reset mode         */
#endif
#endif
    }
  }

  return (__TRUE);
}


/*------------------------- USBH_STM32_Init ------------------------------------
 *
 *  Initialize or uninitialize the USB Host Controller
 *
 *  Parameter:  ctrl:       Controller index (0 = OTG_FS, 1 = OTG_HS)
 *              on:         __TRUE = initialize, __FALSE = uninitialize
 *  Return:                 __TRUE = Ok, __FALSE = error
 *----------------------------------------------------------------------------*/

BOOL USBH_STM32_Init (U8 ctrl, BOOL on) {
  OTG_HS_TypeDef *ptr_OTG;
  S32             tout;

  ptr_OTG = (OTG_HS_TypeDef *)OTG[ctrl];

  if (on) {
    USBH_STM32_Delay_ms (10);                     /* Delay to calibrate delay */
    if (!ctrl) {
      /* Initialize memory pool for data                                      */
      if (!usbh_mem_init(0, (U32 *)&USBH0_MPOOL, USBH0_STM32_SZ_MPOOL))
        return (__FALSE);

      RCC->AHB2ENR     |=  (   1 <<  7);          /* OTG FS clock enable      */
      USBH_STM32_Delay_ms (10);                   /* Wait ~10 ms              */
      RCC->AHB2RSTR    |=  (   1 <<  7);          /* Reset OTG FS clock       */
      USBH_STM32_Delay_ms (10);                   /* Wait ~10 ms              */
      RCC->AHB2RSTR    &= ~(   1 <<  7);
      USBH_STM32_Delay_ms (40);                   /* Wait ~40 ms              */
    } else if (ctrl == 1) {
      /* Initialize memory pool for data                                      */
      if (!usbh_mem_init(1, (U32 *)&USBH1_MPOOL, USBH1_STM32_SZ_MPOOL))
        return (__FALSE);

      RCC->AHB1ENR     |=  (   1 << 29);          /* OTG HS clock enable      */
      USBH_STM32_Delay_ms (10);                   /* Wait ~10 ms              */
      RCC->AHB1RSTR    |=  (   1 << 29);          /* Reset OTG HS clock       */
      USBH_STM32_Delay_ms (10);                   /* Wait ~10 ms              */
      RCC->AHB1RSTR    &= ~(   1 << 29);
      USBH_STM32_Delay_ms (40);                   /* Wait ~40 ms              */
#ifndef __OTG_HS_EMBEDDED_PHY
      RCC->AHB1ENR     |=  (   1 << 30);          /* OTG HS ULPI clock enable */
#endif
    }

