MBronsom/OfflineSWD/Firmware/keil_standard_20200910/RL/USB/Drivers/usbh_stm32f20x.c
    if (!ctrl) {
      ptr_OTG->GUSBCFG |=  1 << 6;                        /* Full-spd trnscvr */
    } else {
#ifndef __OTG_HS_EMBEDDED_PHY
      ptr_OTG->GUSBCFG &=~(1 << 6);                       /* High-spd trnscvr */
      ptr_OTG->GUSBCFG |=  USBH_STM32_GUSBCFG_PTCI       |/* Ind. pass through*/
                           USBH_STM32_GUSBCFG_PCCI       |/* Ind. complement  */
                           USBH_STM32_GUSBCFG_ULPIEVBUSI |/* ULPI ext Vbus ind*/
                           USBH_STM32_GUSBCFG_ULPIEVBUSD; /* ULPI ext Vbus drv*/
#else
      ptr_OTG->GUSBCFG |=   1 << 6;                       /* Full-spd trnscvr */
      ptr_OTG->GCCFG   &= ~(1UL << 19); /* Disable VBUS sensing of "B" device */
      ptr_OTG->GCCFG   &= ~(1UL << 18); /* Disable VBUS sensing of "A" device */
      ptr_OTG->GCCFG   |=  (1UL << 21); /* No VBUS sensing                    */
#endif
    }
    USBH_STM32_Delay_ms (20);                     /* Wait ~20 ms              */

    for (tout = 1100; tout >= 0; tout--) {        /* Wait max 1 second        */
      if (ptr_OTG->GRSTCTL & (1UL << 31))         /* Wait for AHB Idle        */
        break;
      if (!tout) 
        return (__FALSE);
      if (tout <= 100)
        USBH_STM32_Delay_ms (10);
    }
    ptr_OTG->GRSTCTL |= 1;                        /* USB Core Reset           */
    for (tout = 1100; tout >= 0; tout--) {        /* Wait max 1 second        */
      if (!(ptr_OTG->GRSTCTL & 1))                /* Wait for Core Reset end  */
        break;
      if (!tout) 
        return (__FALSE);
      if (tout <= 100)
        USBH_STM32_Delay_ms (10);
    }
    USBH_STM32_Delay_ms (3);                      /* Wait ~3 ms               */

    ptr_OTG->GAHBCFG   &= ~USBH_STM32_GAHBCFG_GINTMSK;    /* Disable ints     */

    if (!ctrl) {
      ptr_OTG->GCCFG   |=  USBH_STM32_GCCFG_SOFOUTEN |    /* Enable SOF output*/
                           USBH_STM32_GCCFG_PWRDWN   ;    /* Disable power dwn*/
    } else {
      ptr_OTG->GCCFG   |=  
#ifdef __OTG_HS_EMBEDDED_PHY
                           USBH_STM32_GCCFG_NOVBUSSENS|   /* No VBUS sensing  */
#endif
                           USBH_STM32_GCCFG_SOFOUTEN |    /* Enable SOF output*/
                           USBH_STM32_GCCFG_PWRDWN   ;    /* Disable power dwn*/
    }

    USBH_STM32_DMA_Enable ();

    ptr_OTG->GUSBCFG   &=~(USBH_STM32_GUSBCFG_TRDT(15));
    ptr_OTG->GUSBCFG   |=  USBH_STM32_GUSBCFG_FHMOD   |   /* Force host mode  */
                           USBH_STM32_GUSBCFG_TRDT(5);    /* Turnaround time  */
    USBH_STM32_Delay_ms (100);                    /* Wait ~100 ms             */

    /* Core initialization                                                    */
    ptr_OTG->GRXFSIZ    =  (512/4) +                /* RxFIFO depth is 512 by */
                                2  +                /* 8 bytes for Int EP     */
                                4  ;                /* Packet info and status */
    if (!ctrl) 
      OTG_FS->HNPTXFSIZ = ((512/4)<<16) | ((512/4)+6);    /* Non-peri TxFIFO  */
    else if (ctrl == 1)
      ptr_OTG->GNPTXFSIZ= ((512/4)<<16) | ((512/4)+6);    /* Non-peri TxFIFO  */
    ptr_OTG->HPTXFSIZ   = (16<<16) |  (((512/4)*2)+6);    /* Peri TxFIFO mem  */

    ptr_OTG->GINTMSK   |=  USBH_STM32_GINTMSK_DISCINT|    /* En disconn int   */
                           USBH_STM32_GINTMSK_HCIM   |    /* En host ch int   */
                           USBH_STM32_GINTMSK_PRTIM  |    /* En host prt int  */
                           USBH_STM32_GINTMSK_RXFLVLM|    /* Enable RXFIFO int*/
                           USBH_STM32_GINTMSK_SOFM   ;    /* Enable SOF int   */
    if (!(ptr_OTG->HCFG & 3)) {
      if (!ctrl) {
        ptr_OTG->HCFG   =  USBH_STM32_HCFG_FSLSPCS(1)|    /* PHY clk at 48MHz */
                           USBH_STM32_HCFG_FSLS(1);       /* FS/LS only       */
      } else if (ctrl == 1) {
#ifdef __OTG_HS_EMBEDDED_PHY
        ptr_OTG->HCFG   =  USBH_STM32_HCFG_FSLSPCS(1)|    /* PHY clk at 48MHz */
                           USBH_STM32_HCFG_FSLS(1);       /* FS/LS only       */
#else
        ptr_OTG->HCFG   =  USBH_STM32_HCFG_FSLSPCS(1);    /* PHY clk at 48MHz */
#endif
      }
    }
    ptr_OTG->HAINTMSK   =  0xFFFF;                        /* En all ch ints   */

    if (!ctrl) {
      ptr_OTG->HAINTMSK =  0xFF;                          /* En all ch ints   */
      NVIC_SetPriority (OTG_FS_IRQn, 0);/* Set OTG interrupt highest priority */
      NVIC_EnableIRQ   (OTG_FS_IRQn);   /* Enable OTG interrupt               */
    } else if (ctrl == 1) {
      ptr_OTG->HAINTMSK =  0xFFFF;                        /* En all ch ints   */
      NVIC_SetPriority (OTG_HS_IRQn, 0);/* Set OTG interrupt highest prio     */
      NVIC_EnableIRQ   (OTG_HS_IRQn);   /* Enable OTG interrupt               */
    }
    ptr_OTG->GAHBCFG   |=  USBH_STM32_GAHBCFG_GINTMSK;    /* Enable interrupts*/
  } else {
    if (!ctrl) {
      NVIC_DisableIRQ  (OTG_FS_IRQn);   /* Disable OTG interrupt              */

      ptr_OTG->HAINTMSK&= ~0xFF;        /* Disable channel interrupts         */
      RCC->AHB2RSTR    |= (   1 <<  7); /* OTG FS reset                       */
      USBH_STM32_Delay_ms (10);         /* Wait ~10 ms                        */
      RCC->AHB2RSTR    &=~(   1 <<  7); /* OTG FS not reset                   */
      USBH_STM32_Delay_ms (10);         /* Wait ~10 ms                        */
      RCC->AHB2ENR     &=~(   1 <<  7); /* OTG FS clock disable               */
      USBH_STM32_Delay_ms (40);         /* Wait ~40 ms                        */
    } else if (ctrl == 1) {
      NVIC_DisableIRQ  (OTG_HS_IRQn);   /* Disable OTG interrupt              */

      ptr_OTG->HAINTMSK&= ~0xFFFF;      /* Disable all channel interrupts     */
      RCC->AHB1RSTR    |= (   1 << 29); /* OTG HS reset                       */
      USBH_STM32_Delay_ms (10);         /* Wait ~10 ms                        */
      RCC->AHB1RSTR    &=~(   1 << 29); /* OTG HS not reset                   */
      USBH_STM32_Delay_ms (10);         /* Wait ~10 ms                        */
      RCC->AHB1ENR     &=~(   1 << 29); /* OTG HS clock disable               */
      RCC->AHB1ENR     &=~(   1 << 30); /* OTG HS ULPI clock disable          */
      USBH_STM32_Delay_ms (40);         /* Wait ~40 ms                        */
    }

    ptr_OTG->HPRT       =  0;                             /* Rst host prt ctrl*/
    ptr_OTG->HCFG       =  0;                             /* Reset host config*/
    ptr_OTG->GINTMSK   &=~(USBH_STM32_GINTMSK_DISCINT|    /* Disable ints     */
                           USBH_STM32_GINTMSK_HCIM   |
                           USBH_STM32_GINTMSK_PRTIM  |
                           USBH_STM32_GINTMSK_RXFLVLM|
                           USBH_STM32_GINTMSK_SOFM  );
    ptr_OTG->GUSBCFG   &=~(USBH_STM32_GUSBCFG_FHMOD  |    /* Reset USB cfg    */
                           USBH_STM32_GUSBCFG_TRDT(15));
    if (!ctrl)
      ptr_OTG->GUSBCFG &= ~USBH_STM32_GUSBCFG_PHYSEL; 
    ptr_OTG->GUSBCFG   |=  USBH_STM32_GUSBCFG_TRDT(2);    /* Set init values  */
    calDelay = 0;                                 /* Force delay recalibrate  */
    USBH_STM32_Delay_ms (100);          /* Wait ~100 ms                       */
  }

  return (__TRUE);
}


/*------------------------- USBH_STM32_Port_Power ------------------------------
 *
 *  Turn USB Host port power on or off
 *
 *  Parameter:  ctrl:       Controller index (0 = OTG_FS, 1 = OTG_HS)
 *              on:         __TRUE = power on, __FALSE = power off
 *  Return:                 __TRUE = Ok, __FALSE = error
 *----------------------------------------------------------------------------*/

BOOL USBH_STM32_Port_Power (U8 ctrl, BOOL on) {
  OTG_HS_TypeDef *ptr_OTG;
  
  ptr_OTG = (OTG_HS_TypeDef *)OTG[ctrl];

  if (on) {
    ptr_OTG->HPRT    |=  USBH_STM32_HPRT_PPWR;  /* Port power on              */
    if (!ctrl) {
#ifdef __XYNERGY
      GPIOB->BSRRH   =  (   1 <<  2);           /* PB2 drive low              */
#else
      GPIOH->BSRRH   =  (   1 <<  5);           /* PH5 drive low              */
#endif
    }
#ifdef __MCBSTM32F200
    else {
      GPIOC->BSRRH   =  (   1 <<  2);           /* PC2 drive low              */
    }
#endif
  } else {
    if (!ctrl){
#ifdef __XYNERGY
      GPIOB->BSRRL   =  (   1 <<  2);           /* PB2 drive high             */
#else
      GPIOH->BSRRL   =  (   1 <<  5);           /* PH5 drive high             */
#endif
    }
#ifdef __MCBSTM32F200
    else {
      GPIOC->BSRRL   =  (   1 <<  2);           /* PC2 drive  high            */
    }
#endif
    ptr_OTG->HPRT    &= ~USBH_STM32_HPRT_PPWR;  /* Port power off             */
  }

  return (__TRUE);
}


/*------------------------- USBH_STM32_Port_Reset ------------------------------
 *
 *  Reset Port
 *
 *  Parameter:  ctrl:       Controller index (0 = OTG_FS, 1 = OTG_HS)
 *              port:       Root Hub port to be reset (only 0 is available)
 *  Return:                 __TRUE = Ok, __FALSE = error
 *----------------------------------------------------------------------------*/

BOOL USBH_STM32_Port_Reset (U8 ctrl, U8 port) {
  OTG_HS_TypeDef *ptr_OTG;
  U32             hcfg, hprt;
  S32             tout;

  if (!Port_Con[ctrl])
    return (__FALSE);
  
  ptr_OTG = (OTG_HS_TypeDef *)OTG[ctrl];

  hcfg = ptr_OTG->HCFG;
  hprt = ptr_OTG->HPRT;
  switch ((hprt >> 17) & 3) {
    case 0:                             /* High-speed detected                */
      ptr_OTG->HFIR   = 48000;
      if ((hcfg & 3)  != 1) {
        hcfg          = (hcfg & ~USBH_STM32_HCFG_FSLSPCS(3)) | USBH_STM32_HCFG_FSLSPCS(1);
        ptr_OTG->HCFG =  hcfg;
      }
      break;
    case 1:                             /* Full-speed detected                */
      ptr_OTG->HFIR   = 48000;
      if ((hcfg & 3)  != 1) {
        hcfg          = (hcfg & ~USBH_STM32_HCFG_FSLSPCS(3)) | USBH_STM32_HCFG_FSLSPCS(1);
        ptr_OTG->HCFG =  hcfg;
      }
      break;
    case 2:                             /* Low-speed detected                 */
      ptr_OTG->HFIR   = 6000;
      if ((hcfg & 3)  != 2) {
        hcfg          = (hcfg & ~USBH_STM32_HCFG_FSLSPCS(3)) | USBH_STM32_HCFG_FSLSPCS(2);
        ptr_OTG->HCFG =  hcfg;
      }
      break;
    case 3:
      break;
  }

  ptr_OTG->HPRT |=  USBH_STM32_HPRT_PRST;             /* Port reset           */
  USBH_STM32_Delay_ms (17);                           /* Wait ~17 ms          */
  ptr_OTG->HPRT &= ~USBH_STM32_HPRT_PRST;             /* Clear port reset     */

